Hi @dupondje I've tested it on our environment, everything works as expected, vm is reachable once it's up(tested it manually and using ansible).

Steps to test this PR:
```bash
# 1.I cloned @maxbes's changes to 
git clone  git@github.com:Worteks/terraform-provider-ovirt.git ~/.terraform.d/plugins/localproviders/ovirt-provider 
# 2. Build the code and stored it in  ~/.terraform.d/plugins/localproviders/ovirt-provider/ovirt/0.0.1/darwin_arm64/terraform-provider-ovirt
# 3. I have a ~/.terraformrc in which I specified provider_instalation details
```
Terraform code:
<img width="1666" alt="Screenshot 2025-05-16 at 11 57 23" src="https://github.com/user-attachments/assets/c1e1054a-96e0-4914-bcac-1e7ece4c619a" />

Terraform Output:
```
➜  terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ovirt_nic.this will be created
  + resource "ovirt_nic" "this" {
      + id              = (known after apply)
      + name            = "private-1"
      + vm_id           = (known after apply)
      + vnic_profile_id = "8e017bb7-a948-4f75-9db3-8daad1a9djyef"
    }

  # ovirt_vm.this will be created
  + resource "ovirt_vm" "this" {
      + cluster_id                   = "010ef917-4945-4b43-bc7c-ce123cc9f3f9"
      + effective_template_id        = (known after apply)
      + id                           = (known after apply)
      + initialization_custom_script = <<-EOT
            hostname: static-ip-test
            fqdn: static-ip-test.example.com
        EOT
      + name                         = "static-ip-test"
      + status                       = (known after apply)
      + template_id                  = "01459612-c59d-44ee-834a-f123a18df30f"

      + initialization_nic {
          + name = "enp1s0"

          + ipv4 {
              + address = "10.0.0.2"
              + gateway = "10.0.0.1"
              + netmask = "255.255.255.0"
            }
        }
    }

  # ovirt_vm_start.this will be created
  + resource "ovirt_vm_start" "this" {
      + force_stop    = true
      + id            = (known after apply)
      + status        = "up"
      + stop_behavior = "stop"
      + vm_id         = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
ovirt_vm.this: Creating...
ovirt_vm.this: Creation complete after 1s [id=1f4280d7-88a7-43bd-889e-15ecde360aa1]
ovirt_nic.this: Creating...
ovirt_nic.this: Creation complete after 1s [id=a540ae53-e7ca-46e5-9d49-855af2cc7599]
ovirt_vm_start.this: Creating...
ovirt_vm_start.this: Still creating... [10s elapsed]
ovirt_vm_start.this: Still creating... [20s elapsed]
ovirt_vm_start.this: Still creating... [30s elapsed]
ovirt_vm_start.this: Still creating... [40s elapsed]
ovirt_vm_start.this: Still creating... [50s elapsed]
ovirt_vm_start.this: Still creating... [1m0s elapsed]
ovirt_vm_start.this: Still creating... [1m10s elapsed]
ovirt_vm_start.this: Creation complete after 1m18s [id=1f4280d7-88a7-43bd-889e-15ecde360aa1]
╷
│ Warning: Insecure connection mode enabled.
│ 
│   with provider["localproviders/ovirt-provider/ovirt"],
│   on main.tf line 5, in provider "ovirt":
│    5:   tls_insecure = true
│ 
│ The insecure connection mode to oVirt is enabled. This is a very bad idea because Terraform will not validate the certificate of the oVirt engine.
│ 
│ (and 2 more similar warnings elsewhere)
╵

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
➜ 
```

VM data:
![Screenshot 2025-05-16 at 12 02 51](https://github.com/user-attachments/assets/cd40e584-ceb5-454e-badf-91d279226b38)
